ПочтовыйМодуль/src/Documents/ЭлектронноеПисьмоВходящее/ЭлектронноеПисьмоВходящее.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭлектронноеПисьмоВходящее</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторНаСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кодировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипТекста</name>
    <type>
      <types>EnumRef.ТипыТекстовЭлектронныхПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОПрочтении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОДоставке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолучателиПисьма</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиКопий</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВложенныеФайлы</name>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеВложения</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ПолныйПутьКФайлу</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ПочтовыйМодуль/src/Enums/ТипыТекстовЭлектронныхПисем/ТипыТекстовЭлектронныхПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыТекстовЭлектронныхПисем</name>
  <enumValues>
    <name>HTML</name>
  </enumValues>
  <enumValues>
    <name>ПростойТекст</name>
  </enumValues>
  <enumValues>
    <name>РазмеченныйТекст</name>
  </enumValues>
  <enumValues>
    <name>HTMLСКартинками</name>
  </enumValues>
</mdclass:Enum>

ПочтовыйМодуль/src/Documents/ЭлектронноеПисьмоВходящее/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.Заголовок = Объект.Тема;
	ЭтаФорма.ТолькоПросмотр = Истина;
	
	тПредставлениеОтправителя = СокрЛП(Объект.ОтправительПредставление) + " <"+ СокрЛП(Объект.ОтправительАдрес) +">";
	
	Если Объект.ТипТекста = ПредопределенноеЗначение("Перечисление.ТипыТекстовЭлектронныхПисем.HTML") или 
		Объект.ТипТекста = ПредопределенноеЗначение("Перечисление.ТипыТекстовЭлектронныхПисем.HTMLСКартинками") тогда
		Элементы.ГруппаТекстHTML.Видимость = Истина;
		Элементы.ГруппаТекст.Видимость = Ложь;
	Иначе
		Элементы.ГруппаТекстHTML.Видимость = ложь;
		Элементы.ГруппаТекст.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	текДан = Элементы.ВложенныеФайлы.ТекущаяСтрока;
	текДанные = Элементы.ВложенныеФайлы.ТекущиеДанные;
	если текДан<>неопределено и ЗначениеЗаполнено(текДанные.ПолныйПутьКФайлу) тогда
		ДанныеФайла = текДанные.ПолныйПутьКФайлу;                                 
			списокКнопокВопроса = новый СписокЗначений ();
			
			списокКнопокВопроса.Добавить("Скачать","Скачать");
			списокКнопокВопроса.Добавить("Отмена","Отмена");
			
			оповещение = новый ОписаниеОповещения ("ОбработатьОтветНаВопрос",ЭтотОбъект,ДанныеФайла);
			ПоказатьВопрос(оповещение,"Выберите действие",списокКнопокВопроса,30,"Скачать","Что хотите сделать?","Отмена");
			
		иначе
			ПоказатьПредупреждение(,"данные не найдены");
		КонецЕсли;		
	

КонецПроцедуры



&НаКлиенте
процедура ОбработатьОтветНаВопрос (РезультатВопроса,ДополнительныеПараметры) экспорт
	текДан = Элементы.ВложенныеФайлы.ТекущаяСтрока;
	текДанные = Элементы.ВложенныеФайлы.ТекущиеДанные;
	
	времХранилище="";
	если	РезультатВопроса = "Скачать" тогда
		времХранилище = ПоместитьВоВременноеХранилище(ДополнительныеПараметры,ЭтаФорма.УникальныйИдентификатор);
		НачатьПолучениеФайлаССервера(времХранилище, текДанные.ПолныйПутьКФайлу);
		удалитьНаСервере(времХранилище);
	иначе
		возврат;
	КонецЕсли;
	
	
	
КонецПроцедуры


&насервере
процедура удалитьНаСервере(времХранилище)
	УдалитьФайлы(времХранилище)
	КонецПроцедуры
